app/Controllers/UserCrud.php

SELECT *
FROM `users`
ORDER BY `id` DESC
---
    public function list()
    {
        $userModel = new UserModel();
        $data['users'] = $userModel->orderBy('id', 'DESC')->findAll();

SELECT *
FROM `users`
ORDER BY `id` DESC
---
    public function index()
    {
        $userModel = new UserModel();
        $data['users'] = $userModel->orderBy('id', 'DESC')->findAll();

INSERT INTO `users` (`name`, `email`) VALUES ('ubay bin alfian', 'ubayrambe@gmail.com')
---
    public function store()
    {
        $userModel = new UserModel();
        $data = [
            'name' => $this->request->getVar('name'),
            'email'  => $this->request->getVar('email'),
        ];
        $userModel->insert($data);

SELECT *
FROM `users`
WHERE `id` = '13'
 LIMIT 1
---
    public function singleUser($id = null)
    {
        $userModel = new UserModel();
        $data['user_obj'] = $userModel->where('id', $id)->first();

DELETE FROM `users`
WHERE `id` = '11'
AND `id` IN ('11')
---
    public function delete($id = null)
    {
        $userModel = new UserModel();
        $data['user'] = $userModel->where('id', $id)->delete($id);

SELECT *
FROM `users`
WHERE `id` = '13'
 LIMIT 1
---
    public function print($id = null)
    {
        $userModel = new UserModel();
        $data['user_obj'] = $userModel->where('id', $id)->first();

SELECT *
FROM `users`
ORDER BY `id` DESC
---
    public function list1()
    {
        $userModel1 = new UserModel();
        $data1['users1'] = $userModel1->orderBy('id', 'DESC')->findAll();